Revit 2027 API
Application.NewTypeBinding(CategorySet) Method
Creates a new type binding object containing the categories passed as a parameter.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TypeBinding NewTypeBinding(
	CategorySet categorySet
)
Public Function NewTypeBinding (
	categorySet As CategorySet
) As TypeBinding
public:
TypeBinding^ NewTypeBinding(
	CategorySet^ categorySet
)
member NewTypeBinding :
        categorySet : CategorySet -> TypeBinding
Parameters
categorySet CategorySet
A set of categories that will be added to the binding.
Return Value
TypeBinding
A new type binding object.
Remarks
Type binding objects are used for attaching shared parameter definitions to a type within a category.
See Also
Reference
Application Class
NewTypeBinding Overload
Autodesk.Revit.Creation Namespace